In [4]:
import os

import pandas as pd

In [6]:
titanic_data = pd.read_csv(os.path.join('titanic.csv'))

In [7]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [8]:
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
titanic_data.drop(columns=['PassengerId', 'Name', 'Ticket', 'Cabin'], inplace=True)

In [12]:
from sklearn import preprocessing

# FUCK

In [ ]:
# titanic_data[titanic_data.isnull().any(axis=1)]

In [ ]:
# titanic_data = titanic_data.dropna()

In [ ]:
# from sklearn.cluster import MeanShift

# analyzer = MeanShift(bandwidth=30)
# analyzer.fit(titanic_data)

In [ ]:
# from sklearn.cluster import estimate_bandwidth
# estimate_bandwidth(titanic_data)

In [ ]:
# FUCK

In [ ]:
# import numpy as np
# n.unique(labels)

In [ ]:
# titanic_data['cluster_group'] = labels
# titanic_data

In [ ]:
# titanic_data.describe()

In [ ]:
# titanic_data.groupby([cluster_group]).mean()

In [ ]:
# titanic_df = titanic_data.groupby([cluster_group]).mean()

In [ ]:
# titanic_df['Counts'] = titanic_data.groupby(['cluster_group'])    FUUUUCK

In [ ]:
# titanic_df

In [ ]:
# titanic_data[titanic_data['cluster_group'] == 1].describe()

In [ ]:
# titanic_data[titanic_data['cluster_group'] == 1]